---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RoofConstraintLevelParam
source: html/e102221a-1a8d-8d68-21f2-a630d7c38ee5.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RoofConstraintLevelParam Property

"Reference Level"

## Syntax (C#)
```csharp
public static ForgeTypeId RoofConstraintLevelParam { get; }
```